In [1]:
import pandas as pd

In [3]:
data = [[1,2,3],[4,5,6],[7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
list('321')

['3', '2', '1']

In [6]:
                #dados   #index      #colunas
df = pd.DataFrame(data, list('321'), list('ZYX'))

df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [10]:
df.sort_index(inplace = True)

df #organizou os dados da tabela de forma diferente

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [12]:
df.sort_index(inplace = True, axis = 1) # AXIS mexe nas colunas

df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [14]:
df.sort_values(by = 'X', inplace= True)

df #agora ele vai organizar a partir da coluna X

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [16]:
df.sort_values(by = '3', axis= 1, inplace= True) #aqui tive que adicionar o AXIS

df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [21]:
df.sort_index()

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [22]:
df.sort_index(axis = 1) #inverteu a tabela de cima index 321 & coluna XYZ

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [25]:
df.sort_index(axis = 1, inplace= True)
df #mantem sem alterar a anterior

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

#### <font color="yellow">Exercicio</font>

In [51]:
df_ex = {'Nome': {0: 'Ary', 1: 'Catia', 2: 'Carlos', 3 : 'Beto', 4 : 'Bruna', 5 : 'Ana'},
         'Sexo': {0: 'M', 1: 'F', 2: 'M', 3 : 'M', 4 : 'F', 5 : 'F'},
         'Idade': {0: '21', 1: '19', 2: '50', 3 : '29', 4 : '31', 5 : '42'}}
         
df_ex

{'Nome': {0: 'Ary', 1: 'Catia', 2: 'Carlos', 3: 'Beto', 4: 'Bruna', 5: 'Ana'},
 'Sexo': {0: 'M', 1: 'F', 2: 'M', 3: 'M', 4: 'F', 5: 'F'},
 'Idade': {0: '21', 1: '19', 2: '50', 3: '29', 4: '31', 5: '42'}}

In [52]:
df_A = pd.DataFrame(df_ex)

In [53]:
df_A

     Nome Sexo Idade
0     Ary    M    21
1   Catia    F    19
2  Carlos    M    50
3    Beto    M    29
4   Bruna    F    31
5     Ana    F    42

In [78]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome']) #separando a tabela por ordem nome e sexo (alfabetica)

df_B

     Nome Sexo Idade
5     Ana    F    42
4   Bruna    F    31
1   Catia    F    19
0     Ary    M    21
3    Beto    M    29
2  Carlos    M    50

#### <font color="yellow">fim</font>